Revit 2027 API
BuiltInFailures.StairRampFailures.MultistoryStandardStairBottomEndExceedsOrNotReach Property
 One of the stairs inside multistory stairs bottom ends exceeds or cannot reach the base elevation of the stair.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultistoryStandardStairBottomEndExceedsOrNotReach { get; }
Public Shared ReadOnly Property MultistoryStandardStairBottomEndExceedsOrNotReach As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultistoryStandardStairBottomEndExceedsOrNotReach {
	FailureDefinitionId^ get ();
}
static member MultistoryStandardStairBottomEndExceedsOrNotReach : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace